## 21BDA59
## Purva Singh
## Class1_ML_Notebook

### integer

In [1]:
67

67

### float

In [2]:
6.7

6.7

### boolean

In [4]:
True

True

In [5]:
False

False

### strings

In [6]:
'github'

'github'

### Operators

In [7]:
'concate'+'merge'

'concatemerge'

In [9]:
'multiply'*4

'multiplymultiplymultiplymultiply'

### type

In [12]:
type([1,1])

list

In [13]:
type((4,6,7))

tuple

In [14]:
type(8.7)

float

### difference between list and tuple

In [2]:
## list are mutuable means they can be changed , example slicing and indexing can be done whereas tuples are not

In [3]:
[1,2,3]

[1, 2, 3]

In [4]:
(7,7,6)

(7, 7, 6)

### dataframe

In [7]:
import pandas as pd

In [8]:
import numpy as np

In [9]:
P_Dict_Sales = {"Chocolate":[30,40,45],"Biscuits":[150,90,153],"Potatoes":[45,67,38],"Carrots":[20,55,85],"Chips":[67,0,34]}

In [10]:
P_DataFrames = pd.DataFrame(P_Dict_Sales)

In [14]:
P_DataFrames.head()

       Chocolate  Biscuits  Potatoes  Carrots  Chips
Week1         30       150        45       20     67
week2         40        90        67       55      0
week3         45       153        38       85     34

In [15]:
P_DataFrames.head(2)

       Chocolate  Biscuits  Potatoes  Carrots  Chips
Week1         30       150        45       20     67
week2         40        90        67       55      0

In [16]:
P_DataFrames.tail()

       Chocolate  Biscuits  Potatoes  Carrots  Chips
Week1         30       150        45       20     67
week2         40        90        67       55      0
week3         45       153        38       85     34

In [17]:
P_DataFrames.tail(4)

       Chocolate  Biscuits  Potatoes  Carrots  Chips
Week1         30       150        45       20     67
week2         40        90        67       55      0
week3         45       153        38       85     34

### insert

In [18]:
P_DataFrames.insert(3,"papaya",[88,67,54])

In [19]:
P_DataFrames

       Chocolate  Biscuits  Potatoes  papaya  Carrots  Chips
Week1         30       150        45      88       20     67
week2         40        90        67      67       55      0
week3         45       153        38      54       85     34

### count

In [20]:
P_DataFrames["Biscuits"].value_counts()

153    1
90     1
150    1
Name: Biscuits, dtype: int64

### indexing

In [21]:
P_DataFrames.loc["Week1"]

Chocolate     30
Biscuits     150
Potatoes      45
papaya        88
Carrots       20
Chips         67
Name: Week1, dtype: int64

In [22]:
P_DataFrames.iloc[1]

Chocolate    40
Biscuits     90
Potatoes     67
papaya       67
Carrots      55
Chips         0
Name: week2, dtype: int64

In [23]:
P_DataFrames

       Chocolate  Biscuits  Potatoes  papaya  Carrots  Chips
Week1         30       150        45      88       20     67
week2         40        90        67      67       55      0
week3         45       153        38      54       85     34

### operators

In [24]:
P_DataFrames[P_DataFrames >= 50]

       Chocolate  Biscuits  Potatoes  papaya  Carrots  Chips
Week1        NaN       150       NaN      88      NaN   67.0
week2        NaN        90      67.0      67     55.0    NaN
week3        NaN       153       NaN      54     85.0    NaN

In [25]:
P_DataFrames[(P_DataFrames>=0)&(P_DataFrames<50)]

       Chocolate  Biscuits  Potatoes  papaya  Carrots  Chips
Week1         30       NaN      45.0     NaN     20.0    NaN
week2         40       NaN       NaN     NaN      NaN    0.0
week3         45       NaN      38.0     NaN      NaN   34.0

### decribe()

In [26]:
P_DataFrames.describe()

       Chocolate    Biscuits   Potatoes     papaya    Carrots      Chips
count   3.000000    3.000000   3.000000   3.000000   3.000000   3.000000
mean   38.333333  131.000000  50.000000  69.666667  53.333333  33.666667
std     7.637626   35.538711  15.132746  17.156146  32.532035  33.501244
min    30.000000   90.000000  38.000000  54.000000  20.000000   0.000000
25%    35.000000  120.000000  41.500000  60.500000  37.500000  17.000000
50%    40.000000  150.000000  45.000000  67.000000  55.000000  34.000000
75%    42.500000  151.500000  56.000000  77.500000  70.000000  50.500000
max    45.000000  153.000000  67.000000  88.000000  85.000000  67.000000

### info()

In [35]:
P_DataFrames.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Week1 to week3
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Chocolate  3 non-null      int64
 1   Biscuits   3 non-null      int64
 2   Potatoes   3 non-null      int64
 3   Carrots    3 non-null      int64
 4   Chips      3 non-null      int64
dtypes: int64(5)
memory usage: 144.0+ bytes

### adding column

In [28]:
P_DataFrames["Onion"]=[36,45,78]

In [29]:
P_DataFrames

       Chocolate  Biscuits  Potatoes  papaya  Carrots  Chips  Onion
Week1         30       150        45      88       20     67     36
week2         40        90        67      67       55      0     45
week3         45       153        38      54       85     34     78

### adding new row (append)

In [30]:
New_Row = {"Chocolate":67,"Biscuits":56,"Potatoes":89,"Carrots":54,"Chips":98,"Onion":87}

In [31]:
P_DataFrames.append(New_Row, ignore_index= True)

   Chocolate  Biscuits  Potatoes  papaya  Carrots  Chips  Onion
0       30.0     150.0      45.0    88.0     20.0   67.0   36.0
1       40.0      90.0      67.0    67.0     55.0    0.0   45.0
2       45.0     153.0      38.0    54.0     85.0   34.0   78.0
3       67.0      56.0      89.0     NaN     54.0   98.0   87.0

In [32]:
P_DataFrames = pd.DataFrame(P_Dict_Sales, index =["Week1","week2","week3"])

In [33]:
P_DataFrames

       Chocolate  Biscuits  Potatoes  Carrots  Chips
Week1         30       150        45       20     67
week2         40        90        67       55      0
week3         45       153        38       85     34